public class lesson_14_05 {
    //Сравнение коллекций: List vs Set
    //Давайте сравним коллекции двух типов: List и Set. В чем же их основные отличия и когда выгоднее использовать одну, а когда – вторую.

    //Давайте попробуем сравнить Список и Множество на примере детских игрушек.

    //Коллекция List (Список) похожа на набор игрушек в детской комнате, стоящих возле стены.
    //Можно добавить игрушку в конец списка. Можно вставить и в середину, если очень нужно (но часть игрушек придется передвинуть).
    //У каждой игрушки есть порядковый номер. Можно взять игрушку по ее номеру или заменить игрушку номер 7 на игрушку номер 13.
    //Можно удалить из списка игрушку номер 4. Ну и наконец, можно узнать количество всех игрушек в списке.

    //Коллекция Set (Множество) больше похожа на игрушки, сброшенные в кучу.
    //В кучу можно добавить игрушку, можно удалить игрушку из кучи. Но фиксированного номера у таких игрушек нет.
    //Или допустим, вы выбираете ребенку игрушку на день рождения.
    //Тогда вы в первую очередь думаете, есть у него такая игрушка или нет.
    //Тогда все игрушки, которые у него есть, образуют множество игрушек, которые вы решили не покупать.
    //С этой точки зрения порядок игрушек в наборе «уже есть» не играет роли, как и наличие у именинника двух одинаковых игрушек.
    //Вас интересуют не сами игрушки и их количество, а игрушки как набор неких уникальных объектов.
    //Вот для таких случаев вам и понадобится множество Set и его самый популярный представитель — класс HashSet.
}
